Repository: ApacheTech/BlazOrchard
Catalog: src/BlazOrchard.BlazorWebApp/Localization/*/OrchardCore.Lucene.po
Languages: tr

# OrchardCore.Lucene.AdminMenu
source: Search
tr: Ara

# OrchardCore.Lucene.AdminMenu
source: Indexing
tr: Endeksleme

# OrchardCore.Lucene.AdminMenu
source: Lucene Indices
tr: Lucene Endeksleri

# OrchardCore.Lucene.AdminMenu
source: Run Lucene Query
tr: Lucene Sorgusunu Çalıştırın

# OrchardCore.Lucene.AdminMenu
source: Settings
tr: Ayarlar

# OrchardCore.Lucene.Controllers.AdminController
source: Reset
tr: Sıfırla

# OrchardCore.Lucene.Controllers.AdminController
source: Rebuild
tr: Yeniden oluştur

# OrchardCore.Lucene.Controllers.AdminController
source: Delete
tr: Sil

# OrchardCore.Lucene.Controllers.AdminController
source: Any culture
tr: Herhangi bir kültür

# OrchardCore.Lucene.Controllers.AdminController
source: An index named {0} already exists.
tr: {0} adlı bir dizin zaten var.

# OrchardCore.Lucene.Controllers.AdminController
source: An index named {0} doesn't exist.
tr: {0} adlı bir dizin mevcut değil.

# OrchardCore.Lucene.Controllers.AdminController
source: An error occurred while creating the index.
tr: Dizin oluşturulurken bir hata oluştu.

# OrchardCore.Lucene.Controllers.AdminController
source: Index <em>{0}</em> created successfully.
tr: <em>{0}</em> dizini başarıyla oluşturuldu.

# OrchardCore.Lucene.Controllers.AdminController
source: An error occurred while editing the index.
tr: Dizin düzenlenirken bir hata oluştu.

# OrchardCore.Lucene.Controllers.AdminController
source: Index <em>{0}</em> modified successfully, <strong>please consider doing a rebuild on the index.</strong>
tr: <em>{0}</em> dizini başarıyla değiştirildi, <strong>lütfen dizinde yeniden oluşturmayı düşünün.</strong>

# OrchardCore.Lucene.Controllers.AdminController
source: Index <em>{0}</em> reset successfully.
tr: <em>{0}</em> dizini başarıyla sıfırlandı.

# OrchardCore.Lucene.Controllers.AdminController
source: Index <em>{0}</em> rebuilt successfully.
tr: <em>{0}</em> dizini başarıyla yeniden oluşturuldu.

# OrchardCore.Lucene.Controllers.AdminController
source: Index <em>{0}</em> deleted successfully.
tr: <em>{0}</em> dizini başarıyla silindi.

# OrchardCore.Lucene.Controllers.AdminController
source: An error occurred while deleting the index.
tr: Dizin silinirken bir hata oluştu.

# OrchardCore.Lucene.Controllers.AdminController
source: Invalid query : {0}
tr: Geçersiz sorgu: {0}

# OrchardCore.Lucene.Controllers.AdminController
source: Indices successfully removed.
tr: Endeksler başarıyla kaldırıldı.

# OrchardCore.Lucene.Controllers.AdminController
source: At least one content type selection is required.
tr: En az bir içerik türü seçimi gereklidir.

# OrchardCore.Lucene.Controllers.AdminController
source: The index name is required.
tr: Dizin adı gerekli.

# OrchardCore.Lucene.Controllers.AdminController
source: The index name contains unallowed chars.
tr: Dizin adı izin verilmeyen karakterler içeriyor.

# OrchardCore.Lucene.Controllers.SearchController
source: Incorrect query syntax.
tr: Yanlış sorgu sözdizimi.

# OrchardCore.Lucene.Drivers.LuceneQueryDisplayDriver
source: The query field is required
tr: Sorgu alanı gereklidir

# OrchardCore.Lucene.Drivers.LuceneQueryDisplayDriver
source: The index field is required
tr: İndeks alanı zorunludur

# OrchardCore.Lucene.Views.ContentIndexSettings.Edit
source: Include this element in the index
tr: Bu öğeyi dizine dahil et

# OrchardCore.Lucene.Views.ContentIndexSettings.Edit
source: Check to include the value of this element in the index.
tr: Bu öğenin değerini dizine dahil etmek için kontrol edin.

# OrchardCore.Lucene.Views.ContentIndexSettings.Edit
source: Stored
tr: Depolanmış

# OrchardCore.Lucene.Views.ContentIndexSettings.Edit
source: Check to be able to retrieve the value from the index.
tr: Değeri dizinden alabilmek için kontrol edin.

# OrchardCore.Lucene.Views.ContentIndexSettings.Edit
source: Analyzed
tr: analiz edildi

# OrchardCore.Lucene.Views.ContentIndexSettings.Edit
source: Check to analyze the value as readable text.
tr: Değeri okunabilir metin olarak analiz etmek için işaretleyin.

# OrchardCore.Lucene.Views.ContentPickerFieldLuceneEditorSettings.Edit
source: Index
tr: Indeks

# OrchardCore.Lucene.Views.ContentPickerFieldLuceneEditorSettings.Edit
source: The Lucene index to query for content items
tr: Lucene dizini içerik öğelerini sorgulamak içindir

# OrchardCore.Lucene.Views.LuceneQuery.Buttons.SummaryAdmin
source: Run
tr: Çalıştır

# OrchardCore.Lucene.Views.LuceneQuery.Edit
source: Index
tr: Indeks

# OrchardCore.Lucene.Views.LuceneQuery.Edit
source: The lucene index to search on
tr: Aranacak lucene indeksi

# OrchardCore.Lucene.Views.LuceneQuery.Edit
source: Return Content Items
tr: İçerik Öğelerini İade Et

# OrchardCore.Lucene.Views.LuceneQuery.Edit
source: Check to return the corresponding content items.
tr: İlgili içerik öğelerini döndürmek için işaretleyin.

# OrchardCore.Lucene.Views.LuceneQuery.Edit
source: Query
tr: Sorgu

# OrchardCore.Lucene.Views.LuceneQuery.Edit
source: The search query uses the Elasticsearch format. Some documentation can be found here <a target="_blank" href="https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html</a>
tr: Arama sorgusu Elasticsearch biçimini kullanır. Bazı belgeler burada bulunabilir <a target="_blank" href="https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html</a>

# OrchardCore.Lucene.Views.LuceneQuery.SummaryAdmin
source: Lucene query
tr: Lucene Sorgusu

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: Default search index
tr: Varsayılan arama dizini

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: Select a search index
tr: Bir arama dizini seçin

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: The default index to use for the search page.
tr: Arama sayfası için kullanılacak varsayılan dizin.

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: You need to create at least an index to set as the Search index.
tr: Arama dizini olarak ayarlamak için en azından bir dizin oluşturmanız gerekir.

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: Default searched fields
tr: Varsayılan aranan alanlar

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: A comma separated list of fields to use for search pages. The default value is <code>Content.ContentItem.FullText</code>.
tr: Arama sayfaları için kullanılacak alanların virgülle ayrılmış listesi. Varsayılan değer <code>Content.ContentItem.FullText</code>'dir.

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: Allow Lucene queries in search forms
tr: Arama formlarında Lucene sorgularına izin ver

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: Whether search queries should be allowed to use <a href="https://lucene.apache.org/core/2_9_4/queryparsersyntax.html">Lucene query parser syntax</a>.
tr: Arama sorgularının <a href="https://lucene.apache.org/core/2_9_4/queryparsersyntax.html">Lucene sorgu ayrıştırıcı sözdizimini</a> kullanmasına izin verilip verilmeyeceğini belirtir.

# OrchardCore.Lucene.Views.LuceneSettings.Edit
source: See documentation
tr: Dokümantasyonu gör

# OrchardCore.Lucene.Views.NavigationItemText-search.Id
source: Search
tr: Arama

# OrchardCore.Lucene.Views.Query-Lucene.Link
source: Queries a Lucene index.
tr: Bir Lucene indeksi sorgular.

# OrchardCore.Lucene.Views.Query-Lucene.Link
source: Add
tr: Ekle

# OrchardCore.Lucene.Views.Search-Form
source: Enter your search term(s)
tr: Arama terimlerinizi girin

# OrchardCore.Lucene.Views.Search-Form
source: Search
tr: Arama

# OrchardCore.Lucene.Views.Search-Results
source: There are no such results.
tr: Hiçbir sonuç bulunamadı.

# OrchardCore.Lucene.Views.Admin.Edit
source: Create Index
tr: İndeks oluştur

# OrchardCore.Lucene.Views.Admin.Edit
source: Edit Index
tr: Dizini düzenle

# OrchardCore.Lucene.Views.Admin.Edit
source: Index Name
tr: Dizin ismi

# OrchardCore.Lucene.Views.Admin.Edit
source: Analyzer Name
tr: Çözümleyici Adı

# OrchardCore.Lucene.Views.Admin.Edit
source: Culture
tr: Kültür

# OrchardCore.Lucene.Views.Admin.Edit
source: The content culture that it will index.
tr: Dizine ekleyeceği içerik kültürü.

# OrchardCore.Lucene.Views.Admin.Edit
source: Content Types
tr: İçerik Türleri

# OrchardCore.Lucene.Views.Admin.Edit
source: The content types to index. Choose at least one.
tr: Dizine eklenecek içerik türleri. En az birini seçin.

# OrchardCore.Lucene.Views.Admin.Edit
source: Index options
tr: Dizin seçenekleri

# OrchardCore.Lucene.Views.Admin.Edit
source: Index latest version
tr: Dizin son sürüm

# OrchardCore.Lucene.Views.Admin.Edit
source: Check to index draft if it exists, otherwise only the published version is indexed.
tr: Dizin taslağı varsa kontrol edin, aksi takdirde yalnızca yayınlanan sürüm dizine eklenir.

# OrchardCore.Lucene.Views.Admin.Edit
source: Create
tr: Oluştur

# OrchardCore.Lucene.Views.Admin.Edit
source: Cancel
tr: İptal

# OrchardCore.Lucene.Views.Admin.Edit
source: Save
tr: Kaydet

# OrchardCore.Lucene.Views.Admin.Index
source: Indices
tr: Endeksler

# OrchardCore.Lucene.Views.Admin.Index
source: Search
tr: Arama

# OrchardCore.Lucene.Views.Admin.Index
source: Add Index
tr: İndeks ekle

# OrchardCore.Lucene.Views.Admin.Index
source: Select All
tr: Tümünü Seç

# OrchardCore.Lucene.Views.Admin.Index
source: 1 item
tr: 1 öge

# OrchardCore.Lucene.Views.Admin.Index
source: Items {0} to {1}
tr: {0} öğesinden {1} e

# OrchardCore.Lucene.Views.Admin.Index
source: / {0} item in total
tr: / Toplamda {0} öğe

# OrchardCore.Lucene.Views.Admin.Index
source: Actions
tr: Eylemler

# OrchardCore.Lucene.Views.Admin.Index
source: Bulk Action
tr: Toplu Eylem

# OrchardCore.Lucene.Views.Admin.Index
source: Are you sure you want to {0} these items?
tr: Bu nesneleri {0} istediğinizden emin misiniz?

# OrchardCore.Lucene.Views.Admin.Index
source: Query
tr: Sorgu

# OrchardCore.Lucene.Views.Admin.Index
source: Reset Index
tr: Dizini Sıfırla

# OrchardCore.Lucene.Views.Admin.Index
source: This will restart the indexing of all content items. Continue?
tr: Bu, tüm içerik öğelerinin dizine eklenmesini yeniden başlatacaktır. Devam et?

# OrchardCore.Lucene.Views.Admin.Index
source: Yes
tr: Evet

# OrchardCore.Lucene.Views.Admin.Index
source: No
tr: Hayır

# OrchardCore.Lucene.Views.Admin.Index
source: Reset
tr: Sıfırla

# OrchardCore.Lucene.Views.Admin.Index
source: Rebuild Index
tr: Dizini yeniden oluştur

# OrchardCore.Lucene.Views.Admin.Index
source: Your index will be rebuilt, which might alter some services during the process. Continue?
tr: Dizininiz yeniden oluşturulacak ve bu işlem sırasında bazı hizmetleri değiştirebilecek. Devam et?

# OrchardCore.Lucene.Views.Admin.Index
source: Rebuild
tr: Yeniden oluştur

# OrchardCore.Lucene.Views.Admin.Index
source: Edit
tr: Düzenle

# OrchardCore.Lucene.Views.Admin.Index
source: Delete
tr: Sil

# OrchardCore.Lucene.Views.Admin.Index
source: <strong>Nothing here!</strong> There are no indices for the moment.
tr: <strong>Burada hiçbir şey yok!</strong> Şu an için herhangi bir endeks yok.

# OrchardCore.Lucene.Views.Admin.Index
source: selected
tr: seçili

# OrchardCore.Lucene.Views.Admin.Query
source: Lucene Query
tr: Lucene Sorgusu

# OrchardCore.Lucene.Views.Admin.Query
source: Index
tr: Indeks

# OrchardCore.Lucene.Views.Admin.Query
source: The lucene index to search on
tr: Aranacak lucene indeksi

# OrchardCore.Lucene.Views.Admin.Query
source: Template
tr: Şablon

# OrchardCore.Lucene.Views.Admin.Query
source: You can use the <a href="{0}">Match All query</a> to search all documents.
tr: Tüm belgeleri aramak için <a href="{0}">Tümünü Eşleştir</a> sorgusunu kullanabilirsiniz.

# OrchardCore.Lucene.Views.Admin.Query
source: The search query uses the Elasticsearch format. Some documentation can be found here <a target="_blank" href="https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html</a>
tr: Arama sorgusu Elasticsearch biçimini kullanır. Bazı belgeler burada bulunabilir <a target="_blank" href="https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html</a>

# OrchardCore.Lucene.Views.Admin.Query
source: Parameters
tr: Parametreler

# OrchardCore.Lucene.Views.Admin.Query
source: An optional Json object containing the parameter values for this query.
tr: Bu sorgu için parametre değerlerini içeren isteğe bağlı bir Json nesnesi.

# OrchardCore.Lucene.Views.Admin.Query
source: Query
tr: Sorgu

# OrchardCore.Lucene.Views.Admin.Query
source: Found {0} result(s) in {1} ms
tr: {1} ms içinde {0} sonuç bulundu

# OrchardCore.Lucene.Views.Admin.Query
source: Create
tr: Oluştur

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Edit
source: Search Indexes
tr: Indeksleri Ara

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Edit
source: Include all search indexes.
tr: Tüm arama indekslerini tekrar indeksle.

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Edit
source: The search indexes to add as part of the plan.
tr: Planın bir parçası olarak eklenecek arama dizinleri.

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Summary
source: Search Indexes
tr: Indeksleri Ara

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Summary
source: All
tr: Tümü

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Summary
source: No index selected.
tr: Dizin seçilmedi.

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Thumbnail
source: Search Indexes
tr: Dizinleri Ara

# OrchardCore.Lucene.Views.Items.LuceneIndexDeploymentStep.Fields.Thumbnail
source: Exports all or specified search indexes.
tr: Tüm veya belirtilen arama dizinlerini dışa aktarır.

# OrchardCore.Lucene.Views.Items.LuceneSettingsDeploymentStep.Fields.Edit
source: Search Settings
tr: Arama Ayarları

# OrchardCore.Lucene.Views.Items.LuceneSettingsDeploymentStep.Fields.Summary
source: Search Settings
tr: Arama Ayarları

# OrchardCore.Lucene.Views.Items.LuceneSettingsDeploymentStep.Fields.Summary
source: Adds search settings to the plan.
tr: Plana arama ayarları ekler.

# OrchardCore.Lucene.Views.Items.LuceneSettingsDeploymentStep.Fields.Thumbnail
source: Search Settings
tr: Arama Ayarları

# OrchardCore.Lucene.Views.Items.LuceneSettingsDeploymentStep.Fields.Thumbnail
source: Exports search settings.
tr: Arama ayarlarını dışa aktarır.
